/**
 * Туристическая компания предлагает набор маршрутов для
 * путешествий. Каждый маршрут содержит: id, название, страна, стоимость,
 * дополнительная информация. В компанию обратились 4 клиента с целью выбрать
 * подходящий маршрут. В предпочтения входит следующее: максимальная сумма,
 * которую клиент может потратить, набор стран, в которые клиент готов поехать,
 * набор стран, в которые он ни за что не поедет. Задача компании – предложить
 * каждому клиенту подходящие для него варианты, либо сообщить, что таких
 * вариантов нет. При решении создать классы Клиент, Компания и Маршрут. Поля,
 * содержащие наборы элементов (маршруты компании, любимые и не любимые
 * страны) представляют собой массивы, поля являются закрытыми, доступ – через
 * методы.
 */
package adventure;