/**
 * Создать класс MyStack, хранящий произвольное количество
 * элементов типа String. Элементы хранятся в массиве. Количество элементов
 * задается при создании экземпляра MyStack. Добавить в MyStack метод public void
 * Push(String item), добавляющий элемент (если стек заполнен, выбрасывать
 * исключение). Добавить метод public String Pop(), удаляющий последний элемент из
 * стека и возвращающий значение элемента. Если стек пуст - выбрасывать
 * исключение. Создать отдельный класс с методом main, в котором демонстрируется
 * работа MyStack. Исключения из пунктов 2 и 3 обрабатываются в main.
 */
package stack;