/**
 * Создать класс Truck с полями: Текущий вес, Максимальный вес. Поля
 * закрытые, доступ – через методы. Создать конструктор, задающий поля через
 * параметры и конструктор без параметров. Добавить метод IncWeight(double
 * amount), увеличивающий текущий вес на величину amount. При превышении
 * Максимального веса сгенерировать внутри IncWeight исключение. Обрабатывать
 * исключение внутри IncWeight. Создать отдельный класс с методом main, в котором
 * демонстрируется работа Truck.
 */
package truck;